{
  "pt": {
    "nav-home": "Início",
    "nav-about": "Sobre",
    "nav-projects": "Projetos",
    "nav-contact": "Contato",
    "hero-tag": "PRODUCT DESIGNER",
    "hero-title": "Arquitetando soluções para sistemas complexos e missões críticas.",
    "hero-desc": "Especialista em visualização de dados e curadora de acessibilidade, dedico minha carreira a simplificar o complexo. Meu trabalho na INTELIE com setores de alta precisão me ensinou que clareza visual é uma vantagem competitiva. Atuo como mentora e facilitadora, defendendo que um produto só é verdadeiramente bem desenhado quando é acessível a todos, sem exceção.",
    "btn-projects": "Ver Projetos Selecionados",
    "brands-title": "Impacto gerado em grandes players do mercado",
    "projects-title": "Trabalhos Selecionados",
    "projects-desc": "Projetos estratégicos focados em escalabilidade e ROI de design.",
    "case1-tag": "VISUALIZAÇÃO DE DADOS | INTELIE",
    "case1-title": "Data Navigation: Melhorias de navegação em dashboards dinâmicos",
    "case1-desc": "Navegação intuitiva de dados macro e micro em ambientes operacionais complexos.",
    "case1-btn": "Ler case completo na próxima página",
    "case2-tag": "VISUALIZAÇÃO DE DADOS | INTELIE",
    "case2-title": "Escalando ROI através de Design No-Code",
    "case2-desc": "Autonomia para o utilizador final e redução drástica de custos técnicos de manutenção.",
    "case2-btn": "Ler case completo na próxima página",
    "btn-back": "Voltar para o início",
    "meta-role": "Papel",
    "meta-role-val-1": "Designer de Produto",
    "meta-year": "Ano",
    "meta-duration": "Duração",
    "case1-duration": "~8 meses",
    "meta-team": "Equipe",
    "case1-team": "Lead + 4 Devs",
    "meta-status": "Status",
    "meta-status-val": "Em andamento",
    "meta-focus": "Foco",
    "case-resp-title": "Responsabilidades",
    "case-overview-title": "Visão Geral",
    "case-problem-title": "Entendimento do Problema",
    "case-results-title": "Resultados",
    "case1-results": "Melhoria significativa de performance através do pré-carregamento de dados, eliminando esperas de requisição e permitindo renderização instantânea nas interações de zoom.",
    "case2-context-title": "1. Contexto Estratégico",
    "case2-problem-title": "Problema identificado",
    "case2-problem-desc": "Um widget de gráficos temporais que estava sendo usado nos ambientes de clientes de fracking, que foi originalmente criado para um projeto de outro domínio e “reaproveitado” nesse contexto, possuía sérios problemas de manutenção pela forma como foi desenvolvido e não se comunicava com os demais widgets da plataforma, tendo em vista que se tratava de uma estrutura modular. Como resultado, era um widget que acumulava features que já existiam no dashboard, mas não acompanhava outros widgets em interações conjuntas, como PTZ (pan, tilt, zoom).",
    "case2-section2-title": "Objetivos",
    "cta-title": "Vamos construir o futuro complexo juntos?",
    "footer-name": "Carmem Ferreira • Senior Product Designer",
    "footer-copy": "Design e Código focado em WCAG 2.1 • 2024",
    "footer-email-link": "E-mail",
    "footer-linkedin": "Carmem Ferreira | LinkedIn",
    "case2-obj-1": "Integração de features de visualização de dados para o principal widget no-code de dados temporais da plataforma, pois o widget de referência é híbrido e alguns recursos apenas são possíveis via código;",
    "case2-obj-2": "Substituição completa do widget usado atualmente, pela complexidade técnica e alto custo de manutenção e correção de bugs;",
    "case2-obj-3": "Permitir o uso das features originárias do widget usado em fracking para outros mercados.",
    "case2-challenge-title": "2. Desafio",
    "case2-challenge-p1": "A construção do mapa de stakeholders no início do processo foi essencial para identificar todos os atores importantes do projeto e agrupá-los para uma melhor gestão das partes interessadas, de acordo com a fase do projeto em relação à tríade: tecnologia, negócios ou usuário.",
    "case2-challenge-img1-cap": "Captura do Stakeholder Map",
    "case2-challenge-p2": "O desafio maior deste projeto esteve presente no trabalho de mediação entre os três pilares citados, principalmente pelo fato de que a plataforma atual não suportava uma “estrutura de dados ideal” e por conta disso um dos principais gaps do projeto era técnico. Sendo assim, foi necessário um trabalho cuidadoso de priorização, de forma que fosse possível fazer pequenas entregas em fases para adaptação do usuário na transferência de uso do novo widget, mas de forma que as primeiras entregas atendessem a requisitos de viabilidade técnica para o momento e atendessem às necessidades mais urgentes dos usuários.",
    "case2-challenge-p3": "O segundo maior desafio foi inserir no discovery uma etapa de aprendizado de domínio, pois até o momento eu projetava soluções de visualização de dados genéricas para qualquer mercado ou para o domínio de drilling, pertencente ao mercado de O&G. No entanto, o projeto se tratava de uma iniciativa de trazer soluções também para o domínio de fracking, que se trata de outro método de extração de petróleo, portanto era necessário um estudo extenso sobre processos, jornadas dos diferentes perfil de usuários e sobre a estrutura de dados, que era completamente diferente. Para isso, o uso de IA generativa foi essencial, pois além de me auxiliar no processo de UX research e imersão no novo domínio que eu ainda não tinha conhecimento, o uso dela foi importante para otimizar o processo de documentação de transcrições de reuniões e organização de demais documentos.",
    "case2-decisions-title": "3. Decisões Estratégicas",
    "case2-decisions-p1": "O ponto forte da entrega do projeto, que ainda está em andamento, foi sua priorização estruturada e acordada por todas as partes, respeitando o ritmo de adaptação da plataforma tecnicamente para suportar uma estrutura de dados não suportada, algo negociado cross-squads, mas levando em consideração a necessidade do usuário. Sendo assim, a divisão de entregas teve a seguinte divisão, depois de sessões de priorização em que facilitei usando o framework MoSCoW com diferentes grupos de stakeholders:",
    "case2-decisions-l1": "Primeira entrega: features consideradas must have, que eram viáveis tecnicamente no momento e podiam ser utilizadas por clientes de outros domínios;",
    "case2-decisions-l2": "Segunda entrega: features consideradas must have, que eram viáveis tecnicamente no momento e atendiam somente ao domínio de fracking;",
    "case2-decisions-l3": "Terceira entrega em diante ainda seriam negociadas;",
    "case2-decisions-img1-cap": "Uma das features entregues no MVP",
    "case2-decisions-img2-cap": "Anatomia do componente e interações prototipadas no Figma Make de uma feature entregue na segunda fase de entrega",
    "case2-impact-title": "4. O Impacto",
    "case2-impact-p1": "Além dos ganhos da substituição de um widget caro para correção e manutenção, com o uso do widget no-code de dados temporais os usuários ganham autonomia para criação e edição de visualizações de dados e o mais importante: não é mais necessário solicitar auxílio de um cientista de dados somente para realizar edições pontuais via código, tendo em vista que o widget substituído utiliza uma linguagem de programação interna da empresa.",
    "case2-impact-p2": "Outro ganho se dá pelo fato do widget no-code poder ser sincronizado com os demais tipos de widgets de dados temporais existentes na plataforma. Sendo assim, os usuários de fracking ganham com uma gama de ferramentas de visualização, análise e de navegação individuais ou agrupadas para usar no dashboard da plataforma, que é compatível com o widget no-code que recebeu as features.",
    "case2-impact-p3": "Vale mencionar também o esforço em tornar a solução genérica o suficiente para atender não somente aos clientes de fracking, mas também aos clientes de drilling e outros mercados, o que expande o uso das features em diferentes frentes. Isso foi graças a muitas entrevistas e reuniões de alinhamento e validação e, com essa iniciativa, foi possível encontrar um caso de uso de grande aderência dentro de um produto interno de drilling, no mapeamento de KPIs, em que uma das features projetadas traria uma redução de espaço vertical de tela de rolagem de aproximadamente 40%.",
    "case2-impact-p4": "Desta forma, considerando que os clientes de drilling atualmente correspondem à maior fonte de receita da empresa, seguidos de fracking, o maior ganho do projeto, além do oferecimento de autonomia e uma gama de features para uso do dashboard no dia a dia, está também ao escalar o uso das features mapeadas e projetadas para usuários dos clientes das duas maiores fontes de receita da companhia.",
    "case2-disclaimer-full": "Este é um projeto interno da INTELIE, portanto a apresentação possuirá restrições de conteúdo para preservar dados sensíveis. Além disso, vale mencionar que a INTELIE tem todos os direitos reservados."
  },
  "en": {
    "nav-home": "Home",
    "nav-about": "About",
    "nav-projects": "Projects",
    "nav-contact": "Contact",
    "hero-tag": "PRODUCT DESIGNER",
    "hero-title": "Architecting solutions for complex systems and critical missions.",
    "hero-desc": "Data visualization specialist and accessibility curator, I dedicate my career to simplifying the complex. My work at INTELIE with high-precision sectors taught me that visual clarity is a competitive advantage. I act as a mentor and facilitator, advocating that a product is only truly well-designed when it is accessible to everyone, without exception.",
    "btn-projects": "View Selected Projects",
    "brands-title": "Impact generated in major market players",
    "projects-title": "Selected Works",
    "projects-desc": "Strategic projects focused on scalability and design ROI.",
    "case1-tag": "DATA VISUALIZATION | INTELIE",
    "case1-title": "Data Navigation: Navigation improvements in dynamic dashboards",
    "case1-desc": "Intuitive navigation of macro and micro data in complex operational environments.",
    "case1-btn": "Read full case on next page",
    "case2-tag": "DATA VISUALIZATION | INTELIE",
    "case2-title": "Scaling ROI through No-Code Design",
    "case2-desc": "Autonomy for the end user and drastic reduction of technical maintenance costs.",
    "case2-btn": "Read full case on next page",
    "btn-back": "Back to home",
    "meta-role": "Role",
    "meta-role-val-1": "Product Designer",
    "meta-year": "Year",
    "meta-duration": "Duration",
    "case1-duration": "~8 months",
    "meta-team": "Team",
    "case1-team": "Lead + 4 Devs",
    "meta-status": "Status",
    "meta-status-val": "Ongoing",
    "meta-focus": "Focus",
    "case-resp-title": "Responsibilities",
    "case-overview-title": "Overview",
    "case-problem-title": "Understanding the Problem",
    "case-results-title": "Results",
    "case1-results": "Significant performance improvement through data pre-loading, eliminating request waits and allowing instant rendering on zoom interactions.",
    "case2-context-title": "1. Strategic Context",
    "case2-problem-title": "Identified Problem",
    "case2-problem-desc": "A time series widget that was being used in fracking client environments, which was originally created for a project in another domain and “repurposed” in this context, had serious maintenance issues due to the way it was developed and did not communicate with the other widgets on the platform, given that it was a modular structure. As a result, it was a widget that accumulated features that already existed in the dashboard, but did not keep up with other widgets in joint interactions, such as PTZ (pan, tilt, zoom).",
    "case2-section2-title": "Objectives",
    "cta-title": "Let's build the complex future together?",
    "footer-name": "Carmem Ferreira • Senior Product Designer",
    "footer-copy": "Design and Code focused on WCAG 2.1 • 2024",
    "footer-email-link": "Email",
    "footer-linkedin": "Carmem Ferreira | LinkedIn",
    "case2-obj-1": "Integration of data visualization features into the platform's main temporal data no-code widget, as the reference widget is hybrid and some features are only possible via code;",
    "case2-obj-2": "Complete replacement of the currently used widget, due to its technical complexity and high cost of maintenance and bug fixing;",
    "case2-obj-3": "Enable the use of features originating from the widget used in fracking for other markets.",
    "case2-challenge-title": "2. Challenge",
    "case2-challenge-p1": "Building the stakeholder map at the beginning of the process was essential to identify all important actors in the project and group them for better stakeholder management, according to the project phase in relation to the triad: technology, business, or user.",
    "case2-challenge-img1-cap": "Stakeholder Map Capture",
    "case2-challenge-p2": "The biggest challenge of this project was mediating between the three aforementioned pillars, mainly because the current platform did not support an 'ideal data structure' and therefore one of the project's main gaps was technical. Thus, careful prioritization work was necessary to allow for small phased deliveries to adapt the user to the new widget, while ensuring the first deliveries met the technical feasibility requirements for the moment and addressed the users' most urgent needs.",
    "case2-challenge-p3": "The second biggest challenge was including a domain learning phase in discovery, as until then I designed generic data visualization solutions for any market or for the drilling domain, belonging to the O&G market. However, the project was an initiative to bring solutions to the fracking domain as well, which is another oil extraction method. Therefore, extensive study was needed on processes, journeys of different user profiles, and the data structure, which was completely different. Generative AI was essential for this, as besides helping me in UX research and immersion in the new domain I didn't yet know, it was important to optimize the process of documenting meeting transcripts and organizing other documents.",
    "case2-decisions-title": "3. Strategic Decisions",
    "case2-decisions-p1": "The strong point of the project delivery, which is still ongoing, was its structured prioritization agreed upon by all parties, respecting the pace of technical adaptation of the platform to support an unsupported data structure—something negotiated cross-squads, but taking the user's needs into consideration. Therefore, the division of deliveries was as follows, after prioritization sessions that I facilitated using the MoSCoW framework with different stakeholder groups:",
    "case2-decisions-l1": "First delivery: features considered 'must have', which were technically feasible at the moment and could be used by clients from other domains;",
    "case2-decisions-l2": "Second delivery: features considered 'must have', which were technically feasible at the moment and catered exclusively to the fracking domain;",
    "case2-decisions-l3": "Third delivery onwards were still to be negotiated;",
    "case2-decisions-img1-cap": "One of the features delivered in the MVP",
    "case2-decisions-img2-cap": "Component anatomy and interactions prototyped in Figma Make for a feature delivered in the second phase",
    "case2-impact-title": "4. The Impact",
    "case2-impact-p1": "In addition to the gains from replacing an expensive widget in terms of fixing and maintenance, using the temporal data no-code widget gives users autonomy to create and edit data visualizations. More importantly: it is no longer necessary to request a data scientist's help just to make specific edits via code, since the replaced widget used the company's internal programming language.",
    "case2-impact-p2": "Another gain is the fact that the no-code widget can be synchronized with the other types of temporal data widgets on the platform. Thus, fracking users benefit from a range of visualization, analysis, and navigation tools—individual or grouped—to use on the platform dashboard, which is compatible with the no-code widget that received the features.",
    "case2-impact-p3": "It is also worth mentioning the effort to make the solution generic enough to serve not only fracking clients but also drilling clients and other markets, expanding the use of the features across different fronts. This was achieved thanks to many interviews and alignment and validation meetings. With this initiative, it was possible to find a highly applicable use case within an internal drilling product for KPI mapping, where one of the designed features would bring a reduction of vertical scrolling screen space of approximately 40%.",
    "case2-impact-p4": "Therefore, considering that drilling clients currently represent the company's largest revenue source, followed by fracking, the project's biggest gain—besides offering autonomy and a range of features for everyday dashboard use—is also scaling the use of the mapped and designed features for users of the clients from the company's two largest revenue sources.",
    "case2-disclaimer-full": "This is an internal INTELIE project, so the presentation will have content restrictions to preserve sensitive data. Furthermore, it is worth mentioning that INTELIE has all rights reserved."
  }
}