{
  "pt": {
    "nav-home": "Início",
    "nav-about": "Sobre",
    "nav-projects": "Projetos",
    "nav-contact": "Contato",
    "hero-tag": "PRODUCT DESIGNER",
    "hero-title": "Arquitetando soluções para sistemas complexos e missões críticas.",
    "hero-desc": "Especialista em visualização de dados e curadora de acessibilidade, dedico minha carreira a simplificar o complexo. Meu trabalho na INTELIE com setores de alta precisão me ensinou que clareza visual é uma vantagem competitiva. Atuo como mentora e facilitadora, defendendo que um produto só é verdadeiramente bem desenhado quando é acessível a todos, sem exceção.",
    "btn-projects": "Ver Projetos Selecionados",
    "brands-title": "Impacto gerado em grandes players do mercado",
    "projects-title": "Trabalhos Selecionados",
    "projects-desc": "Projetos estratégicos focados em escalabilidade e ROI de design.",
    "case1-tag": "VISUALIZAÇÃO DE DADOS | INTELIE",
    "case1-title": "Data Navigation: Melhorias de navegação em dashboards dinâmicos",
    "case1-desc": "Navegação intuitiva de dados macro e micro em ambientes operacionais complexos.",
    "case1-btn": "Ler case completo na próxima página",
    "case2-tag": "VISUALIZAÇÃO DE DADOS | INTELIE",
    "case2-title": "Escalando ROI através de Design No-Code",
    "case2-desc": "Autonomia para o utilizador final e redução drástica de custos técnicos de manutenção.",
    "case2-btn": "Ler case completo na próxima página",
    "btn-back": "Voltar para o início",
    "meta-role": "Papel",
    "meta-role-val-1": "Designer de Produto",
    "meta-year": "Ano",
    "meta-duration": "Duração",
    "case1-duration": "~8 meses",
    "meta-team": "Equipe",
    "case1-team": "Lead + 4 Devs",
    "meta-status": "Status",
    "meta-status-val": "Em andamento",
    "meta-focus": "Foco",
    "case-disclaimer": "Este é um projeto interno da INTELIE, com restrições de conteúdo para preservação de dados sensíveis.",
    "case-resp-title": "Responsabilidades",
    "case1-resp-1": "Estabelecimento de processo de design",
    "case1-resp-2": "Processo de discovery e definição",
    "case1-resp-3": "Entrevista semiestruturada",
    "case1-resp-4": "Estratégia de priorização",
    "case1-resp-5": "Apresentação executiva e Documentação de Handoff",
    "case-overview-title": "Visão Geral",
    "case1-overview": "O utilizador de O&G necessita consumir, no mesmo dashboard, informações gerais sobre a vida útil de um poço e eventos menores de interesse dentro de uma visão \"macro\". O Data Navigation foi projetado para uma interação fluida em widgets dinâmicos, reduzindo o tempo de espera e aumentando a eficiência operacional.",
    "case-problem-title": "Entendimento do Problema",
    "case1-quote": "“As pessoas que utilizam os dashboards precisam navegar de forma fluida, rápida e assertiva pelos gráficos, porque atualmente têm dificuldade para explorar os dados e o tempo de carregamento é longo.\"",
    "case-results-title": "Resultados",
    "case1-results": "Melhoria significativa de performance através do pré-carregamento de dados, eliminando esperas de requisição e permitindo renderização instantânea nas interações de zoom.",
    "case2-context-title": "1. Contexto Estratégico",
    "case2-problem-title": "Problema identificado",
    "case2-problem-desc": "Um widget de gráficos temporais que estava sendo usado nos ambientes de clientes de fracking, que foi originalmente criado para um projeto de outro domínio e “reaproveitado” nesse contexto, possuía sérios problemas de manutenção pela forma como foi desenvolvido e não se comunicava com os demais widgets da plataforma, tendo em vista que se tratava de uma estrutura modular. Como resultado, era um widget que acumulava features que já existiam no dashboard, mas não acompanhava outros widgets em interações conjuntas, como PTZ (pan, tilt, zoom).",
    "cta-title": "Vamos construir o futuro complexo juntos?",
    "footer-name": "Carmem Ferreira • Senior Product Designer",
    "footer-copy": "Design e Código focado em WCAG 2.1 • 2024",
    "footer-email-link": "E-mail",
    "footer-linkedin": "Carmem Ferreira | LinkedIn"
  },
  "en": {
    "nav-home": "Home",
    "nav-about": "About",
    "nav-projects": "Projects",
    "nav-contact": "Contact",
    "hero-tag": "PRODUCT DESIGNER",
    "hero-title": "Architecting solutions for complex systems and critical missions.",
    "hero-desc": "Data visualization specialist and accessibility curator, I dedicate my career to simplifying the complex. My work at INTELIE with high-precision sectors taught me that visual clarity is a competitive advantage. I act as a mentor and facilitator, advocating that a product is only truly well-designed when it is accessible to everyone, without exception.",
    "btn-projects": "View Selected Projects",
    "brands-title": "Impact generated in major market players",
    "projects-title": "Selected Works",
    "projects-desc": "Strategic projects focused on scalability and design ROI.",
    "case1-tag": "DATA VISUALIZATION | INTELIE",
    "case1-title": "Data Navigation: Navigation improvements in dynamic dashboards",
    "case1-desc": "Intuitive navigation of macro and micro data in complex operational environments.",
    "case1-btn": "Read full case on next page",
    "case2-tag": "DATA VISUALIZATION | INTELIE",
    "case2-title": "Scaling ROI through No-Code Design",
    "case2-desc": "Autonomy for the end user and drastic reduction of technical maintenance costs.",
    "case2-btn": "Read full case on next page",
    "btn-back": "Back to home",
    "meta-role": "Role",
    "meta-role-val-1": "Product Designer",
    "meta-year": "Year",
    "meta-duration": "Duration",
    "case1-duration": "~8 months",
    "meta-team": "Team",
    "case1-team": "Lead + 4 Devs",
    "meta-status": "Status",
    "meta-status-val": "Ongoing",
    "meta-focus": "Focus",
    "case-disclaimer": "This is an internal INTELIE project, with content restrictions to preserve sensitive data.",
    "case-resp-title": "Responsibilities",
    "case1-resp-1": "Establishment of design process",
    "case1-resp-2": "Discovery and definition process",
    "case1-resp-3": "Semi-structured interview",
    "case1-resp-4": "Prioritization strategy",
    "case1-resp-5": "Executive presentation and Handoff Documentation",
    "case-overview-title": "Overview",
    "case1-overview": "The O&G user needs to consume, in the same dashboard, general information about the useful life of a well and minor events of interest within a \"macro\" view. Data Navigation was designed for fluid interaction in dynamic widgets, reducing wait times and increasing operational efficiency.",
    "case-problem-title": "Understanding the Problem",
    "case1-quote": "\"The people who use the dashboards need to navigate fluidly, quickly, and assertively through the graphs, because they currently have difficulty exploring the data and the loading time is long.\"",
    "case-results-title": "Results",
    "case1-results": "Significant performance improvement through data pre-loading, eliminating request waits and allowing instant rendering on zoom interactions.",
    "case2-context-title": "1. Strategic Context",
    "case2-problem-title": "Identified Problem",
    "case2-problem-desc": "A temporal charting widget being used in fracking client environments, originally created for another domain and \"reused\", had serious maintenance problems and didn't communicate with other platform widgets. As a result, it accumulated redundant features but failed to follow shared interactions like PTZ (pan, tilt, zoom).",
    "cta-title": "Let's build the complex future together?",
    "footer-name": "Carmem Ferreira • Senior Product Designer",
    "footer-copy": "Design and Code focused on WCAG 2.1 • 2024",
    "footer-email-link": "Email",
    "footer-linkedin": "Carmem Ferreira | LinkedIn"
  }
}